{
	"version": "https://jsonfeed.org/version/1.1",
	"title": "Armin Sadeghi",
	"language": "en",
	"home_page_url": "https://arminsadeghi.com/",
	"feed_url": "https://arminsadeghi.com/feed/feed.json",
	"description": "Eyes of an engineer",
	"author": {
		"name": "Armin Sadeghi",
		"url": "https://arminsadeghi.com/about/"
	},
	"items": [
		{
			"id": "https://arminsadeghi.com/blog/case-insensitive-autocomplete-in-bash",
			"url": "https://arminsadeghi.com/blog/case-insensitive-autocomplete-in-bash",
			"title": "Case-insensitive Autocomplete in Bash",
			"content_html": "<p>I use auto complete on the command line all the time to avoid having to type the full name of a file. Love it. What I hate is how it’s case-sensitive in bash, so I can’t do <code>cd ~/desk</code> to go to the <code>~/Desktop</code> folder.</p>\n<p>The fix for this is to use the shell input options file <strong>.inputrc</strong></p>\n<p>Just set this one option and restart your shell:</p>\n<pre class=\"language-bash\" tabindex=\"0\"><code class=\"language-bash\"><span class=\"token builtin class-name\">echo</span> <span class=\"token string\">'set completion-ignore-case On'</span> <span class=\"token operator\">>></span> ~/.inputrc</code></pre>\n<p>If you happen to have a system wide inputrc settings (<code>/etc/inputrc</code>) and want it included then you should add the following to your .inputrc file:</p>\n<pre><code>$include /etc/inputrc\n</code></pre>\n",
			"date_published": "2010-05-27T00:00:00Z"
		}
		,
		{
			"id": "https://arminsadeghi.com/blog/software-shortcuts",
			"url": "https://arminsadeghi.com/blog/software-shortcuts",
			"title": "Software shortcuts",
			"content_html": "<p>How many times have you used your code editor to look for some text and either didn’t find what you were after, or worse yet – were told that it’s not there when in fact it was? I bet this has happened to us all at some stage, and after some struggle you master the editor and life goes on, however I want to go over some basic tools/commands that you can always fall back to.</p>\n<p>One of the most useful is searching through files. In the windows world you should all know about <strong>findstr</strong>. In particular the following variation:</p>\n<pre class=\"language-dos\" tabindex=\"0\"><code class=\"language-dos\">findstr /snip /c:\"string to look for\" *.cpp</code></pre>\n<p>This command will go through all sub directories, ignoring case, looking through all cpp files for the specified string. And it never lies. In the linux world you want to use something like this:</p>\n<pre class=\"language-bash\" tabindex=\"0\"><code class=\"language-bash\"><span class=\"token function\">find</span> <span class=\"token builtin class-name\">.</span> <span class=\"token operator\">|</span> <span class=\"token function\">xargs</span> <span class=\"token function\">grep</span> <span class=\"token string\">'string to look for'</span></code></pre>\n<p>If you find yourself repeating steps like this often, place the command in a script. Here is the one I use (it ignores SVN hidden folders and uses color output):</p>\n<pre class=\"language-bash\" tabindex=\"0\"><code class=\"language-bash\"><span class=\"token shebang important\">#!/bin/bash</span>\n<span class=\"token function\">find</span> <span class=\"token builtin class-name\">.</span> <span class=\"token operator\">!</span> <span class=\"token parameter variable\">-path</span> <span class=\"token string\">\"*.svn*\"</span> <span class=\"token operator\">|</span> <span class=\"token function\">xargs</span> <span class=\"token function\">grep</span> <span class=\"token string\">\"<span class=\"token variable\">$1</span>\"</span> <span class=\"token parameter variable\">--color</span><span class=\"token operator\">=</span>always</code></pre>\n<p>You can perform all the above searching by using only grep as well:</p>\n<pre class=\"language-bash\" tabindex=\"0\"><code class=\"language-bash\"><span class=\"token function\">grep</span> <span class=\"token string\">'string to find'</span> * --exclude-dir<span class=\"token operator\">=</span><span class=\"token string\">\".svn\"</span> <span class=\"token parameter variable\">-R</span> <span class=\"token parameter variable\">--color</span><span class=\"token operator\">=</span>always`</code></pre>\n",
			"date_published": "2009-03-31T00:00:00Z"
		}
		,
		{
			"id": "https://arminsadeghi.com/blog/transparent-build-systems",
			"url": "https://arminsadeghi.com/blog/transparent-build-systems",
			"title": "Transparent build systems",
			"content_html": "<p>Whenever you deal with a software project, you deal with a build system. The method and process by which you turn your code into a product. This may involve many steps such as pre-processing, compiling, linking, moving files around, and signing among others. The trouble is that on some projects this system becomes an afterthought rather than a purposeful choice. Today I want to briefly talk about the benefits obtained from a good build system.</p>\n<p>So why think seriously about a build system? Why not fire up Visual Studio, hit 'New Project', and just start coding? The simple answer is that you will eventually get stuck, and the last thing you want to get stuck with is a broken limiting build system that is difficult to decipher and extend. A good system will give you:</p>\n<ul>\n<li>A deterministic repeatable build. This will give you confidence that when you create a build it will actually work, the same way as on other machines, every time. No weird oddities or unexplainable results.</li>\n<li>Complete transparency over the build. Including every step, action, process, parameters and files involved, dependencies, and the control by which to alter any of the these.</li>\n</ul>\n<p>&quot;Why is this good? NMake and command lines are painful, should we not have more abstraction?&quot; you may ask. To a degree, yes, modern IDEs and some build tools make things easier, however they are generally designed to handle the common case, not anything complex. For example if your build involves building with different versions of a framework (such as a product targetting v1.1 and v2.0 of the .Net Framework), requiring input and output files in specific folders (seperating source files from generated ones is very helpful for both source control, tracking, and cleaning purposes), or being able to reproduce build steps individually for debugging.</p>\n<p>So what should you do? Its easy, just think about your requirements, the complexity of your project (both now and future), and ensure that you have enough transparency in the build system so that you can get what you need done as well as have the ability to view/fix/extend when necessary. In particular make sure:</p>\n<ul>\n<li>Build settings are stored somewhere easy to view.</li>\n<li>You have full control over where files are written to. The last thing you want is to have random temporary files generated all over your source tree (that you then, accidentally, check in to the depot).</li>\n<li>The build is deterministic. Deleting the output and rebuilding gives you the exact same thing every time.</li>\n<li>You have visibility into each step of the build, so that when something goes wrong you can see what caused it.</li>\n<li>You have control over the tools and dependencies used.</li>\n</ul>\n<p>Basically as much transparency over the process as you can get. Other than that - don't be afraid of make /nmake /rake (or whichever dependency build utility applies to your project) and a command line. They work great!</p>\n",
			"date_published": "2007-12-27T00:00:00Z"
		}
		,
		{
			"id": "https://arminsadeghi.com/blog/manual-vs-automatic-memory-management",
			"url": "https://arminsadeghi.com/blog/manual-vs-automatic-memory-management",
			"title": "Manual vs automatic memory management",
			"content_html": "<p>Good memory management is essential for writing software applications that perform well. If the application takes too long to start or frustrates you as it completes operations, it doesn't make for a good experience. And there are many factors such as response time, working set, and hardware requirements to consider when dealing with performance. However memory management is a key ingredient, and deciding between manual and automatic systems can make a big difference.</p>\n<p>This is such a large topic. Where should I start? ...</p>\n<p>Lets start with some definitions. <a href=\"http://en.wikipedia.org/wiki/Manual_memory_management\">Manual memory management</a> is when the programmer manually controls the lifetime of allocated memory by specifically allocating and freeing it in a deterministic fashion. Alternatively, automatic memory management tries to determine what memory is no longer used and frees it automatically instead of relying on the programmer to identify it. Automatic memory management is sometimes referred to as <a href=\"http://en.wikipedia.org/wiki/Garbage_collection_%28computer_science%29\">Garbage Collection</a> (GC), however &quot;garbage&quot; could be defined as anything, so the term is a little vague. GC often refers to tracing garbage collection, one form of automatic memory management. Reference counting is an alternative automatic memory management method (when you Release an object it isn't necessarily freed, it all depends on the reference count, so as a consumer you do not control memory deallocation). The choice here is mostly independent of programming language. There are some languages that support manual management (such as C, C++), others that support automatic management with tracing GCs (such as Java, and C#), and others still that support both (like <a href=\"http://en.wikipedia.org/wiki/D_programming_language\">D</a>).</p>\n<p>So which one is better? Well the truth is that it all depends. There are many pros and cons to each method (discussed at length on <a href=\"http://en.wikipedia.org/wiki/Memory_management\">wikipedia</a>). In the end you have to pick the solution based on your specific requirements. However today lets talk about performance in particular. If you have some crazy high performance requirements (perhaps a real-time application), what do you do? ... you get more control.</p>\n<p>By using manual memory management you are gaining more control over when memory is allocated and deallocated, giving you, the developer, more control over how to deal with it. You can then be mindful of such things as memory locality, consumption in tight loops, and memory reuse, while avoiding indeterministic deallocation (tracing garbage collectors). You can still have enough control with automatic memory management if you stick with ref counting as a means to control memory/object lifetime. However there is a cost to be paid for these advantages, mostly in development difficulty - the more control you have, the more likely you are to make mistakes (mistakes here lead to memory leaks). And mistakes are bugs.. some bad, some really bad.</p>\n",
			"date_published": "2006-12-16T00:00:00Z"
		}
		,
		{
			"id": "https://arminsadeghi.com/blog/com-aggregation-and-ref-counting-woes",
			"url": "https://arminsadeghi.com/blog/com-aggregation-and-ref-counting-woes",
			"title": "COM aggregation and ref counting woes",
			"content_html": "<p>Why are we talking about <a href=\"http://en.wikipedia.org/wiki/Component_Object_Model\">Component Object Model</a> (COM), isn't that old dead technology? Well… no. There are still so many COM objects in use today, in many projects, that you will run into them sooner or later. As a software engineer you might even have to resolve bugs in these components. Today I want to draw attention to ref counting bugs that can creep in when using aggregation within these objects.</p>\n<p>COM objects use reference counting to control their lifetime. This is achieved through the implementation of an <code>_IUnknown_</code> interface by each and every object. This interface contains (quick – what are the first three v-table entries?) <code>_IUnknown::QueryInterface_</code>, <code>_IUnknown::AddRef_</code> and <code>_IUnknown::Release_</code>. So after you add a reference to an object with <code>_AddRef_</code>, you are expected to call <code>_Release_</code> when you are finished. Reference counting bugs can crop up in object clients when someone forgets this rule and are usually a real pain to find. This difficulty can be compounded even further if the object itself messes up its implementation of <code>_AddRef_</code>.</p>\n<p>The implementation of <code>_AddRef_</code> is typically simple (just increment an internal counter), however when the object aggregates other objects in its internal implementation (another form of object reuse as opposed to using containment) it becomes more complex. In these cases you have to ensure that AddRef and Release calls operate on the correct object.</p>\n<p>Lets take the example of a hypothetical AIRPLANE object. An AIRPLANE is implemented by aggregating WING, and ENGINE objects. WING implements <code>_IWing_</code> and <code>_IUnknown_</code>, ENGINE implements <code>_IEngine_</code> and <code>_IUnknown_</code>. Now clients of the AIRPLANE object would expect that <code>_IWing::AddRef_</code>, and <code>_IEngine::AddRef_</code> both control the lifetime of the outer object (the component/object doing the reusing – in this case AIRPLANE). This is fair and reasonable, however the only way this can happen is if the inner objects (WING and ENGINE) are aware of the outer object. So when WING and ENGINE are created, AIRPLANE passes a pointer to its <code>_IUnknown_</code> implementation (called the controlling unknown) down to the inner objects. If they support aggregation then they will use this pointer to handle any <code>_IUnknown_</code> calls that come in through <code>_IWing_</code> and <code>_IEngine_</code>. If they do not support aggregation they will return <code>CLASS*E_NOAGGREGATION</code> and fail creation. However ENGINE and WING must not delegate to the controlling unknown for any <code>_AddRef_</code> and <code>_Release_</code> calls that come in through <code>_IUnknown_</code> itself, as this is what the outer object will use to control their lifetime.</p>\n<p>These are just the basic rules of aggregation that when applied ensure that object lifetime is still managed correctly. Common problems arise when the inner objects forget to delegate the <code>_AddRef_</code> and <code>_Release_</code> calls to the controlling unknown, or do so in the wrong case (i.e. when called through <code>_IUnknown::AddRef_</code>). In this case the client of AIRPLANE may see what appears to be a ref counting bug on their side, but is actually an internal issue with the aggregation.</p>\n<p>No wonder people like managed code and .NET, ref counting bugs can get tricky!</p>\n",
			"date_published": "2006-11-24T00:00:00Z"
		}
		,
		{
			"id": "https://arminsadeghi.com/blog/windows-powershell",
			"url": "https://arminsadeghi.com/blog/windows-powershell",
			"title": "Windows PowerShell",
			"content_html": "<p>Power users love shells. Not the seafood kind, but the command line interface, computer command scripting kind. Even MacOS which was traditionally GUI driven, now has a shell (albeit somewhat hidden), due to its makeover in OS X. With a shell the user can input text commands to manipulate the computer. The most obvious use of which is the ability to script common operations, or perform functions faster than perhaps the user-interface driven counterpart operation.</p>\n<p>MS Windows based operating systems have been using cmd.exe as their shell for quite some time, until PowerShell came along. <a href=\"http://www.microsoft.com/windowsserver2003/technologies/management/powershell/default.mspx\">Windows PowerShell</a> currently has an RC2 release available for <a href=\"http://www.microsoft.com/technet/scriptcenter/topics/msh/download.mspx\">download</a>. Whats so special about Windows PowerShell?.. where do I start? 🙂</p>\n<p>The biggest change is in the object pipeline. No longer do commands output text, now its all objects. So when you do something like:</p>\n<pre class=\"language-powershell\" tabindex=\"0\"><code class=\"language-powershell\"><span class=\"token function\">Get-Process</span> <span class=\"token punctuation\">|</span> <span class=\"token function\">Format-Wide</span></code></pre>\n<p>The output of <em>Get-Process</em> is piped, as objects, to the next command. In this case <em>Format-Wide</em> takes the objects and formats them in a particular way. You could have used <em>Format-List</em>, or a multitude of other variations. Passing objects allows much richer communication between functions in the command pipeline as well as other shell operations. So you can imagine what something like this may do:</p>\n<pre class=\"language-powershell\" tabindex=\"0\"><code class=\"language-powershell\"><span class=\"token function\">Get-Process</span> m* <span class=\"token punctuation\">|</span> <span class=\"token function\">dir</span></code></pre>\n<p>Yes you guessed it, it actually lists the folder location of all currently running processes that start with the letter m.</p>\n<p>Windows PowerShell also has a whole new syntax. Commands have verb-noun type names which provides for clear, consistent, and easily discoverable functionality (and if you are ever lost, just type &quot;<em>help</em>&quot;, or append &quot;<em>-?</em>&quot; to a command). To help people transition from other shells there are aliased commands, so commands such as &quot;cd&quot;, &quot;dir&quot;, &quot;more&quot; are aliased to their corresponding commands and work just fine.</p>\n<p>I could go on for pages and pages about all the cool new things, but lets just cover two more items, PowerShell drives, and COM object scripting (that I thought was very cool). Have you ever wanted to query the registry and manipulate it right from a script instead of messing with regedit and .reg files? Well try this out:</p>\n<pre class=\"language-powershell\" tabindex=\"0\"><code class=\"language-powershell\">cd HKLM:\\Software</code></pre>\n<p>and now you have navigated to <code>HKEY*LOCAL_MACHINE\\Software</code>. Well what else can you do? Just try <code>\\_Get-PSDrive*</code> to see a list of all the other mapped PowerShell drives you can navigate.</p>\n<p>So what if you have a COM Automation object that you want to work with? Lets say you need to boot Excel, do a few calculations and retrieve the result? Prior to Windows PowerShell this was not trivial but now all you need is a few lines similar to this:</p>\n<pre class=\"language-powershell\" tabindex=\"0\"><code class=\"language-powershell\"><span class=\"token variable\">$xl</span> = <span class=\"token function\">New-Object</span> <span class=\"token operator\">-</span>ComObject Excel<span class=\"token punctuation\">.</span>Application\n<span class=\"token variable\">$xl</span><span class=\"token punctuation\">.</span>Workbooks<span class=\"token punctuation\">.</span>Add<span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span>\n<span class=\"token variable\">$xl</span><span class=\"token punctuation\">.</span>Range<span class=\"token punctuation\">(</span><span class=\"token string\">\"A1\"</span><span class=\"token punctuation\">)</span><span class=\"token punctuation\">.</span>Value2 = 5\n<span class=\"token variable\">$xl</span><span class=\"token punctuation\">.</span>Range<span class=\"token punctuation\">(</span><span class=\"token string\">\"A2\"</span><span class=\"token punctuation\">)</span><span class=\"token punctuation\">.</span>Value2 = 6\n<span class=\"token variable\">$xl</span><span class=\"token punctuation\">.</span>Range<span class=\"token punctuation\">(</span><span class=\"token string\">\"A3\"</span><span class=\"token punctuation\">)</span><span class=\"token punctuation\">.</span>Value2 = <span class=\"token string\">\"=Sum(A1, A2)\"</span>\n<span class=\"token variable\">$output</span> = <span class=\"token variable\">$xl</span><span class=\"token punctuation\">.</span>Range<span class=\"token punctuation\">(</span><span class=\"token string\">\"A3\"</span><span class=\"token punctuation\">)</span>\n<span class=\"token variable\">$xl</span><span class=\"token punctuation\">.</span>Quit<span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span></code></pre>\n<p>It looks similar to C#, but being able to run this straight from a command line script is just great.</p>\n",
			"date_published": "2006-11-02T00:00:00Z"
		}
		
	]
}
